{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "author": null,
          "description": "Added: testing and CI/CD workflows",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "publishedOn": "2021-06-01T04:39:30.000Z",
          "wordCount": 268,
          "title": "v1.10.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.9.0",
          "author": null,
          "description": "Added: experimental support for iTunes podcast feed: Demo | Source. With this new release, you can render an audio control to play the mp3 file and display iTunes episode duration. It is \"experimental\" due to these caveats:\n\nThis feature is currently only available through custom template.\niTunes has no strict format requirement for duration. The unit is most likely seconds but can be \"hh:mm:ss\" or \"mm:ss\" for some sources. A future version may expose a human readable string to the template.\nNo image support yet. Some shows might have disabled CORS or use a relative URL for image, which forces osmosfeed to download the image during build. A future version may support it.\nYou can't republish the podcast in the feed output. Supporting this goes beyond the scope of the project at the moment.\nFixed: the articles in template data were not sorted.\nThank you @Zenigata",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.9.0",
          "publishedOn": "2021-05-26T06:02:55.000Z",
          "wordCount": 413,
          "title": "v1.9.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.1",
          "author": null,
          "description": "Fixed: UnhandledPromiseRejectionWarning: Error: At least one option must be a string",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.1",
          "publishedOn": "2021-05-23T05:40:12.000Z",
          "wordCount": 278,
          "title": "v1.8.1"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.0",
          "author": null,
          "description": "Changed: Smart summary truncation. When there is no dedicated summary (only Atom feed has it, and many sites don't use it) from the source, we check if the content/description (Both Atom and RSS) field is long enough to be full text. If so, it will be truncated into a \"pseudo\" summary. If not, we assume the source used the content field as summary, and it will be displayed in full length.\nThank you: @LooperXX.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.8.0",
          "publishedOn": "2021-05-23T05:12:08.000Z",
          "wordCount": 341,
          "title": "v1.8.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.2",
          "author": null,
          "description": "⚠ Deprecated: To accommodate the monorepo setup, the node version in all templates/demos/examples has changed from 14 to 16. This is not a breaking change as our compile target is still node 14, and node 16 is backward compatible. We still recommend you start using node-version: \"16\" in your .github/workflows/update-feed.yaml today to get the performance/security improvements from the newer node. See example\nChore: Reorganize to monorepo with npm workspace.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.2",
          "publishedOn": "2021-05-17T05:32:19.000Z",
          "wordCount": 336,
          "title": "v1.7.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.1",
          "author": null,
          "description": "Fixed: static files were unnecessarily copied for custom templates.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.1",
          "publishedOn": "2021-05-16T02:33:58.000Z",
          "wordCount": 276,
          "title": "v1.7.1"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.0",
          "author": null,
          "description": "Added: templating system. Demo | Source | Docs\nChore: rendering logic refactoring. Adopting functional paradigm.\nThank you @tianheg, @onnyyonn",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.7.0",
          "publishedOn": "2021-05-16T01:42:24.000Z",
          "wordCount": 286,
          "title": "v1.7.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.4.0",
          "author": null,
          "description": "Added: Basic theme customization: Demo | Source | Docs.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.4.0",
          "publishedOn": "2021-05-10T08:55:42.000Z",
          "wordCount": 276,
          "title": "v1.4.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.6.0",
          "author": null,
          "description": "Added: Link from the title of a subscription to its website.\nAdded: Store feedUrl and siteUrl for each source in cache.\nAdded: Semantic element (<time>) for timestamp on the UI.\nAdded: Semantic API for theming the default template. Demo | Source | Docs\nChanged: Moved feed metadata from article level to feed level in cache.\nFixed: Any html-like text was stripped from title. Fixed with encoded text.\nRemoved: href for each source in cache. The value was never used so it's not a breaking change.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.6.0",
          "publishedOn": "2021-05-10T08:15:20.000Z",
          "wordCount": 352,
          "title": "v1.6.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.5.0",
          "author": null,
          "description": "Added: Atom feed generator\nAdded: Customizable site title\nAdded: Copy all files from static directory to the root of the site.\nChanged: Favicon, css, and js assets now existing at site root level.\nChore: Excluded testing files from repo.",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.5.0",
          "publishedOn": "2021-05-08T05:16:47.000Z",
          "wordCount": 306,
          "title": "v1.5.0"
        }
      ]
    },
    {
      "title": "Dan Luu",
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/essential-complexity/",
          "author": null,
          "description": "In the classic 1986 essay, No Silver Bullet, Fred Brooks argued that there is, in some sense, not that much that can be done to improve programmer productivity. His line of reasoning is that programming tasks contain a core of essential/conceptual1 complexity that's fundamentally not amenable to attack by any potential advances in technology (such as languages or tooling). He then uses an Ahmdahl's law argument, saying that because 1/X of complexity is essential, it's impossible to ever get more than a factor of X improvement via technological improvements.\nTowards the end of the essay, Brooks claims that at least 1/2 (most) of complexity in programming is essential, bounding the potential improvement remaining for all technological programming innovations combined to, at most, a factor of…",
          "link": "https://danluu.com/essential-complexity/",
          "publishedOn": "2020-12-29T00:00:00.000Z",
          "wordCount": 5620,
          "title": "Against essential and accidental complexity"
        },
        {
          "id": "https://danluu.com/car-safety/",
          "author": null,
          "description": "Any time you have a benchmark that gets taken seriously, some people will start gaming the benchmark. Some famous examples in computing are the CPU benchmark specfp and video game benchmarks. With specfp, Sun managed to increase its score on 179.art (a sub-benchmark of specfp) by 12x with a compiler tweak that essentially re-wrote the benchmark kernel, which increased the Sun UltraSPARC’s overall specfp score by 20%. At times, GPU vendors have added specialized benchmark-detecting code to their drivers that lowers image quality during benchmarking to produce higher benchmark scores. Of course, gaming the benchmark isn't unique to computing and we see people do this in other fields. It’s not surprising that we see this kind of behavior since improving benchmark scores by cheating on benchma…",
          "link": "https://danluu.com/car-safety/",
          "publishedOn": "2020-06-30T07:06:34.000Z",
          "wordCount": 7158,
          "title": "How do cars fare in crash tests they're not specifically optimized for?"
        },
        {
          "id": "https://danluu.com/voyager-story/",
          "author": null,
          "description": "This is an archive of an old pseudonymously written post from the 90s that seems to have disappeared from the internet.\nI see that Star Trek: Voyager has added a new character, a Borg.\n(From the photos, I also see that they're still breeding women for breast size\nin the 24th century.) What ticked me off was the producer's comment (I'm\nparaphrasing), \"The addition of Seven of Nine will give us limitless\nstory possibilities.\"\nUh-huh. Riiiiiight.\nLook, they did't recognize the stories they had.\nI watched the first few episodes of Voyager\nand quit when my bullshit meter when off the scale.\n(Maybe that's not fair, to judge them by only a few episodes.\nBut it's not fair to subject me to crap like the holographic lungs, either.)\nFor those of you who don't watch Star Trek: Voyager,\nthe premise is …",
          "link": "https://danluu.com/voyager-story/",
          "publishedOn": "2020-06-02T07:05:34.000Z",
          "wordCount": 1818,
          "title": "Finding the Story"
        },
        {
          "id": "https://danluu.com/tracing-analytics/",
          "author": null,
          "description": "A lot of people seem to think that distributed tracing isn't useful, or at least not without extreme effort that isn't worth it for companies smaller than FB. For example, here are a couple of public conversations that sound like a number of private conversations I've had. Sure, there's value somewhere, but it costs too much to unlock.\nI think this overestimates how much work it is to get a lot of value from tracing. At Twitter, Rebecca Isaacs was able to lay out a vision for how to get value from tracing and executed on it (with help from a number other folks, including Jonathan Simms, Yuri Vishnevsky, Ruben Oanta, Dave Rusek, Hamdi Allam, and many others1) such that the work easily paid for itself. This post is going to describe the tracing \"infrastructure\" we've built and describe some …",
          "link": "https://danluu.com/tracing-analytics/",
          "publishedOn": "2020-05-31T07:06:34.000Z",
          "wordCount": 4116,
          "title": "A simple way to get more value from tracing"
        },
        {
          "id": "https://danluu.com/metrics-analytics/",
          "author": null,
          "description": "We spent one day1 building a system that immediately found a mid 7 figure optimization (which ended up shipping). In the first year, we shipped mid 8 figures per year worth of cost savings as a result. The key feature this system introduces is the ability to query metrics data across all hosts and all services and over any period of time (since inception), so we've called it LongTermMetrics (LTM) internally since I like boring, descriptive, names.\nThis got started when I was looking for a starter project that would both help me understand the Twitter infra stack and also have some easily quantifiable value. Andy Wilcox suggested looking at JVM survivor space utilization for some large services. If you're not familiar with what survivor space is, you can think of it as a configurable, fixed…",
          "link": "https://danluu.com/metrics-analytics/",
          "publishedOn": "2020-05-30T07:06:34.000Z",
          "wordCount": 4097,
          "title": "A simple way to get more value from metrics"
        },
        {
          "id": "https://danluu.com/corp-eng-blogs/",
          "author": null,
          "description": "I've been comparing notes with people who run corporate engineering blogs and one thing that I think is curious is that it's pretty common for my personal blog to get more traffic than the entire corp eng blog for a company with a nine to ten figure valuation and it's not uncommon for my blog to get an order of magnitude more traffic.\nI think this is odd because tech companies in that class often have hundreds to thousands of employees. They're overwhelmingly likely to be better equipped to write a compelling blog than I am and companies get a lot more value from having a compelling blog than I do.\nWith respect to the former, employees of the company will have done more interesting engineering work, have more fun stories, and have more in-depth knowledge than any one person who has a perso…",
          "link": "https://danluu.com/corp-eng-blogs/",
          "publishedOn": "2020-03-11T00:00:00.000Z",
          "wordCount": 2209,
          "title": "How (some) good corporate engineering blogs are written"
        },
        {
          "id": "https://danluu.com/cli-complexity/",
          "author": null,
          "description": "My hobby: opening up McIlroy’s UNIX philosophy on one monitor while reading manpages on the other.\nThe first of McIlroy's dicta is often paraphrased as \"do one thing and do it well\", which is shortened from \"Make each program do one thing well. To do a new job, build afresh rather than complicate old programs by adding new 'features.'\"\nMcIlroy's example of this dictum is:\nSurprising to outsiders is the fact that UNIX compilers produce no listings: printing can be done better and more flexibly by a separate program.\nIf you open up a manpage for ls on mac, you’ll see that it starts with\nls [-ABCFGHLOPRSTUW@abcdefghiklmnopqrstuwx1] [file ...]\n\nThat is, the one-letter flags to ls include every lowercase letter except for {jvyz}, 14 uppercase letters, plus @ and 1. That’s 22 + 14 + 2 = 38 singl…",
          "link": "https://danluu.com/cli-complexity/",
          "publishedOn": "2020-03-03T00:00:00.000Z",
          "wordCount": 4123,
          "title": "The growth of command line options, 1979-Present"
        },
        {
          "id": "https://danluu.com/discontinuities/",
          "author": null,
          "description": "If you read any personal finance forums late last year, there's a decent chance you ran across a question from someone who was desperately trying to lose money before the end of the year. There are a number of ways someone could do this; one commonly suggested scheme was to buy put options that were expected to expire worthless, allowing the buyer to (probably) take a loss.\nOne reason people were looking for ways to lose money was that, in the U.S., there's a hard income cutoff for a health insurance subsidy at $48,560 for individuals (higher for larger households; $100,400 for a family of four). There are a number of factors that can cause the details to vary (age, location, household size, type of plan), but across all circumstances, it wouldn't have been uncommon for an individual going…",
          "link": "https://danluu.com/discontinuities/",
          "publishedOn": "2020-02-18T00:00:00.000Z",
          "wordCount": 3696,
          "title": "Suspicious discontinuities"
        },
        {
          "id": "https://danluu.com/p95-skill/",
          "author": null,
          "description": "Reaching 95%-ile isn't very impressive because it's not that hard to do. I think this is one of my most ridiculable ideas. It doesn't help that, when stated nakedly, that sounds elitist. But I think it's just the opposite: most people can become (relatively) good at most things.\nNote that when I say 95%-ile, I mean 95%-ile among people who participate, not all people (for many activities, just doing it at all makes you 99%-ile or above across all people). I'm also not referring to 95%-ile among people who practice regularly. The \"one weird trick\" is that, for a lot of activities, being something like 10%-ile among people who practice can make you something like 90%-ile or 99%-ile among people who participate.\nThis post is going to refer to specifics since the discussions I've seen about th…",
          "link": "https://danluu.com/p95-skill/",
          "publishedOn": "2020-02-07T00:00:00.000Z",
          "wordCount": 7147,
          "title": "95%-ile isn't that good"
        },
        {
          "id": "https://danluu.com/algorithms-interviews/",
          "author": null,
          "description": "When I ask people at trendy big tech companies why algorithms quizzes are mandatory, the most common answer I get is something like \"we have so much scale, we can't afford to have someone accidentally write an O(n^2) algorithm and bring the site down\"1.  One thing I find funny about this is, even though a decent fraction of the value I've provided for companies has been solving phone-screen level algorithms problems on the job, I can't pass algorithms interviews! When I say that, people often think I mean that I fail half my interviews or something. It's more than half.\nWhen I wrote a draft blog post of my interview experiences, draft readers panned it as too boring and repetitive because I'd failed too many interviews. I should summarize my failures as a table because no one's going to wa…",
          "link": "https://danluu.com/algorithms-interviews/",
          "publishedOn": "2020-01-05T00:00:00.000Z",
          "wordCount": 5771,
          "title": "Algorithms interviews: theory vs. practice"
        },
        {
          "id": "https://danluu.com/deconstruct-files/",
          "author": null,
          "description": "This is a psuedo-transcript for a talk given at Deconstruct 2019. To make this accessible for people on slow connections as well as people using screen readers, the slides have been replaced by in-line text (the talk has ~120 slides; at an average of 20 kB per slide, that's 2.4 MB. If you think that's trivial, consider that half of Americans still aren't on broadband and the situation is much worse in developing countries.\nLet's talk about files! Most developers seem to think that files are easy. Just for example, let's take a look at the top reddit r/programming comments from when Dropbox announced that they were only going to support ext4 on Linux (the most widely used Linux filesystem). For people not familiar with reddit r/programming, I suspect r/programming is the most widely read En…",
          "link": "https://danluu.com/deconstruct-files/",
          "publishedOn": "2019-07-12T00:00:00.000Z",
          "wordCount": 6586,
          "title": "Files are fraught with peril"
        },
        {
          "id": "https://danluu.com/overwatch-gender/",
          "author": null,
          "description": "A recurring discussion in Overwatch (as well as other online games) is whether or not women are treated differently from men. If you do a quick search, you can find hundreds of discussions about this, some of which have well over a thousand comments. These discussions tend to go the same way and involve the same debate every time, with the same points being made on both sides. Just for example, these three threads on reddit that spun out of a single post that have a total of 10.4k comments. On one side, you have people saying \"sure, women get trash talked, but I'm a dude and I get trash talked, everyone gets trash talked there's no difference\", \"I've never seen this, it can't be real\", etc., and on the other side you have people saying things like \"when I play with my boyfriend, I get accu…",
          "link": "https://danluu.com/overwatch-gender/",
          "publishedOn": "2019-02-19T00:00:00.000Z",
          "wordCount": 6001,
          "title": "Randomized trial on gender in Overwatch"
        },
        {
          "id": "https://danluu.com/fsyncgate/",
          "author": null,
          "description": "This is an archive of the original \"fsyncgate\" email thread. This is posted here because I wanted to have a link that would fit on a slide for a talk on file safety with a mobile-friendly non-bloated format.\nFrom:Craig Ringer <craig(at)2ndquadrant(dot)com>\nSubject:Re: PostgreSQL's handling of fsync() errors is unsafe and risks data loss at least on XFS\nDate:2018-03-28 02:23:46\n\nHi all\nSome time ago I ran into an issue where a user encountered data corruption\nafter a storage error. PostgreSQL played a part in that corruption by\nallowing checkpoint what should've been a fatal error.\nTL;DR: Pg should PANIC on fsync() EIO return. Retrying fsync() is not OK at\nleast on Linux. When fsync() returns success it means \"all writes since the\nlast fsync have hit disk\" but we assume it means \"all writes…",
          "link": "https://danluu.com/fsyncgate/",
          "publishedOn": "2018-03-28T00:00:00.000Z",
          "wordCount": 84172,
          "title": "Fsyncgate: errors on fsync are unrecovarable"
        },
        {
          "id": "https://danluu.com/input-lag/",
          "author": null,
          "description": "I've had this nagging feeling that the computers I use today feel slower than the computers I used as a kid. As a rule, I don’t trust this kind of feeling because human perception has been shown to be unreliable in empirical studies, so I carried around a high-speed camera and measured the response latency of devices I’ve run into in the past few months. Here are the results:\ntable {border-collapse:collapse;margin:0px auto;}table,th,td {border: 1px solid black;}td {text-align:center;}td.l {text-align:left;}\n\n\ncomputerlatency\n(ms)yearclock# T\napple 2e3019831 MHz3.5k\nti 99/4a4019813 MHz8k\ncustom haswell-e 165Hz5020143.5 GHz2G\ncommodore pet 40166019771 MHz3.5k\nsgi indy601993.1 GHz1.2M\ncustom haswell-e 120Hz6020143.5 GHz2G\nthinkpad 13 chromeos7020172.3 GHz1G\nimac g4 os 9702002.8 GHz11M\ncustom …",
          "link": "https://danluu.com/input-lag/",
          "publishedOn": "2017-12-24T00:00:00.000Z",
          "wordCount": 4778,
          "title": "Computer latency: 1977-2017"
        },
        {
          "id": "https://danluu.com/bad-decisions/",
          "author": null,
          "description": "A statement I commonly hear in tech-utopian circles is that some seeming inefficiency can’t actually be inefficient because the market is efficient and inefficiencies will quickly be eliminated. A contentious example of this is the claim that companies can’t be discriminating because the market is too competitive to tolerate discrimination. A less contentious example is that when you see a big company doing something that seems bizarrely inefficient, maybe it’s not inefficient and you just lack the information necessary to understand why the decision was efficient.\nUnfortunately, arguments like this are difficult to settle because, even in retrospect, it’s usually not possible to get enough information to determine the precise “value” of a decision. Even in cases where the decision led to …",
          "link": "https://danluu.com/bad-decisions/",
          "publishedOn": "2017-11-21T00:00:00.000Z",
          "wordCount": 5923,
          "title": "How good are decisions?"
        }
      ]
    },
    {
      "title": "Tom MacWright",
      "feedUrl": "https://macwright.com/atom.xml",
      "siteUrl": "https://macwright.com/atom.xml",
      "articles": [
        {
          "id": "https://macwright.com/2021/06/01/recently.html",
          "author": null,
          "description": "This was a big month. May 1 feels like eons ago. I’m in a different\nplace (New York). The\nsituation with COVID feels dramatically different. Acquired a few new\ngray hairs due to the absolute horror which is the logistics of moving\ncross-country, especially during a pandemic. We spent a few nervous weeks\nwaiting for furniture to arrive, and dreading the next interaction with our\nabsolutely-terrible-no-good moving company. When VCs and some tech company\n‘disrupt’ moving by undercutting and technologizing movers, I will make\nan exception and cheer them on: this industry deserves to end.\nBut then, seeing so many old faces, reconnecting, finding a new\nfavorite restaurant and bar every few days. Visiting family. Feeling some optimism\nabout the general future.\n\nCaleb Porzio’s making 100k as an em…",
          "link": "https://macwright.com/2021/06/01/recently.html",
          "publishedOn": "2021-06-01T00:00:00.000Z",
          "wordCount": 492,
          "title": "Recently"
        },
        {
          "id": "https://macwright.com/2021/05/02/recently.html",
          "author": null,
          "description": "I just moved to New York. Three years and nine months ago, I landed in San Francisco. When you leave San Francisco, you’re required to write a Medium post about it, so here’s mine.\nSan Francisco is a dream to run in. You have hills like Twin Peaks that tower over the city, rugged places like Glen Canyon where you can forget you’re in a city. Running around the Embarcadero in the heat, and running to the ocean via Golden Gate Park, where that last leg of JFK Drive gets chilly because of the sea breeze. Elevation is so unavoidable that some hilly runs start to seem flat, then you visit another city and realize you can run 20 seconds faster a mile when things are actually flat.\nWhen I moved to San Francisco, I moved to the Haight-Ashbury. Realizing the mistake, I lived in the Mission District…",
          "link": "https://macwright.com/2021/05/02/recently.html",
          "publishedOn": "2021-05-02T00:00:00.000Z",
          "wordCount": 651,
          "title": "Recently - New York"
        },
        {
          "id": "https://macwright.com/2021/03/16/return-of-fancy-tools.html",
          "author": null,
          "description": "Technology is seeing a little return to complexity. Dreamweaver gave way to hand-coding websites, which is now leading into Webflow, which is a lot like Dreamweaver. Evernote give way to minimal Markdown notes, which are now becoming Notion, Coda, or Craft. Visual Studio was “disrupted” by Sublime Text and TextMate, which are now getting replaced by Visual Studio Code. JIRA was replaced by GitHub issues, which is getting outmoded by Linear.\nThe pendulum swings back and forth, which isn’t a bad thing. Some of the reasons for the last pivot - from complexity to simplicity - have been solved. Webflow fills a need, and produces better output than Dreamweaver did. Notion is more accessible to people who don’t know Markdown. VS Code is very helpful. Excessively helpful. It’s fine.\nThe same probl…",
          "link": "https://macwright.com/2021/03/16/return-of-fancy-tools.html",
          "publishedOn": "2021-03-16T00:00:00.000Z",
          "wordCount": 537,
          "title": "The return of fancy tools"
        },
        {
          "id": "https://macwright.com/2021/03/11/vendor-by-default.html",
          "author": null,
          "description": "This isn’t a recommendation. It’s more of a habit that I’ve acquired recently. If this makes its way to Hacker News\nand people think how could he, my only response will be 🤷, why not.\nI’ve been building a thing, in JavaScript, an application sort of like things I’ve built in the past. With the same basic goal of making something useful. How I get to that goal is flexible. But it ends up being a lot of using boring technology, trying not to overthink the easy parts, trying to properly-think the hard parts, and so on. So there’s not that much to write home about that would surprise your usual React/Next.js/JavaScript engineer person.\nBut one thing that I do think is sort of unusual is: I’m vendoring a lot of stuff.\nVendoring, in the programming sense, means “copying the source code of anoth…",
          "link": "https://macwright.com/2021/03/11/vendor-by-default.html",
          "publishedOn": "2021-03-11T00:00:00.000Z",
          "wordCount": 1003,
          "title": "Vendor by default"
        },
        {
          "id": "https://macwright.com/2021/03/05/immutable-approaches.html",
          "author": null,
          "description": "These are some rough thoughts on how to do immutability in programming, to power undo. If you’re looking for an opinionated ‘this is how to do it’ sort of post, I’ve written that about Immutable.js. This is more a publicly-shared scratchpad.\nFor the fourth or so time in my career, I’m thinking about and implementing an ‘undo’ function. Undo is a powerful feature because it lets people do destructive or major operations without worrying because they can just hit command-z. Implementing undo is a subtle challenge for both UX & algorithms.\nI don’t think that my standard approach, in-memory immutability, is the way to go anymore.\nIn-memory immutability\n\nconst myself = Immutable.Map({ name: \"Tom\", favoriteColor: \"red\" });\nconst you = myself.set(\"name\", \"You\");\n\n\nThis is what was in Mapbox Studi…",
          "link": "https://macwright.com/2021/03/05/immutable-approaches.html",
          "publishedOn": "2021-03-05T00:00:00.000Z",
          "wordCount": 921,
          "title": "Immutable approaches"
        },
        {
          "id": "https://macwright.com/2021/03/03/recently.html",
          "author": null,
          "description": "A little late on this one! I’ve been focusing a bit on projects and work, and those days flipped past.\nListening\nI’ve been catching up on some back catalogs - Childish Gambino’s 3.15.20 and Beach House’s Depression Cherry.\nDepression Cherry by Beach House\n\nThe little bit of new music is Claud’s spectacular “Super Monster” a hit-packed little indie pop album. (via Rebecca Williams)\nSuper Monster by Claud\n\nWatching\n\n\nI’m the last person in the world to watch Spinal Tap, but boy is it fun.\nAdam Neely continues to make great stuff, like his breakdown of the ‘sea shanty’ trend on TikTok, from a music history perspective.\nReading\nI had bad luck with books in February, grinding my way through two that didn’t inspire. But then On Writing from Stephen King, which was excellent, and I’m part-way through Patricia Lockwood’s new book, No One Is Talking about This which is awesome so far. It’s, sure, for the incredibly online.\nIn my experience, if you’re incredibly online, then books that talk about the Internet, but are written by or for the the occasionally online – are unreadable. They live on the surface, exploring surface level memes like milkshake-duck or Pepe. So you mostly read books that are unrelated to the Internet, so that you don’t read some re-explanation of milkshake-ducking for the fifth time. Anyway, Lockwood lives it, knows the real stuff, and she’s also a fantastically good writer.",
          "link": "https://macwright.com/2021/03/03/recently.html",
          "publishedOn": "2021-03-03T00:00:00.000Z",
          "wordCount": 243,
          "title": "Recently"
        },
        {
          "id": "https://macwright.com/2021/02/23/one-way-to-represent-things.html",
          "author": null,
          "description": "I have a theory about the future of programming. I doubt I’m the first to have it, but as far as I can tell this isn’t the mainstream thought in the area, and I want to see if this connects for other folks.\nThere’s this idea about having ‘one way to do things’, that I think is most famous in its phrasing from the Zen of Python\nThere should be one– and preferably only one –obvious way to do it.\nPerl has the opposite motto: There’s more than one way to do it. Whether it’s better to have “one way to do things”, as I’d guess is the dictum of Python and Go, or many ways, like Rust, JavaScript, Lisps, etc, it’s sort of undecided.\nBut let’s flip the telescope around and peer into the other end.\nProgramming is about data structures and the ways you manipulate them. There are few languages that can…",
          "link": "https://macwright.com/2021/02/23/one-way-to-represent-things.html",
          "publishedOn": "2021-02-23T00:00:00.000Z",
          "wordCount": 614,
          "title": "One way to represent things"
        },
        {
          "id": "https://macwright.com/2021/02/18/a-year-of-rails.html",
          "author": null,
          "description": "I spent most of 2020 working with Ruby on Rails. I moved a project from Next.js + Rust to… Rails, baby! Back to the future. My earlier post on Second-guessing the modern web was inspired by this experience, that for the product we were building, a ‘modern’ stack was not working as well as a traditional one.\nWe didn’t do competitive analysis against Laravel, Django, or Phoenix. They’re similar, not radically better or worse. There are multiple acceptable solutions to a problem, and this was more a matter of choosing the right kind of solution than pursuing some kind of perfect choice and burning hours and motivation doing the window-shopping.\nWhat helped Rails win was that the team had a little more experience in Ruby (with the exception of myself), and we found plenty of resources for deve…",
          "link": "https://macwright.com/2021/02/18/a-year-of-rails.html",
          "publishedOn": "2021-02-18T00:00:00.000Z",
          "wordCount": 2188,
          "title": "A year of Rails"
        },
        {
          "id": "https://macwright.com/2021/02/17/the-naming-of-things.html",
          "author": null,
          "description": "Naming things in programming is hard. It’s not impossible, though. Here are some guidelines I usually follow.\nAvoid weasel words\nWikipedia’s article about weasel words is incredible. In this context I mean words like this:\nData\nProcess\nRun\nDo\nSetup\nThese words usually don’t mean anything at all. Any variable could be called data. Any method could be called process. These words don’t inform or differentiate. Most methods and variables that include these names are misnamed. Think hard and figure out what’s better:\nA method like processData probably isn’t processing any kind of data. Maybe processCsv?\nIs it really just “processing” that CSV. Maybe it’s coercing columns that are strings that should be numbers. Maybe coerceCsvRows?\nThat’s probably better!\nA variable like data probably isn’t gen…",
          "link": "https://macwright.com/2021/02/17/the-naming-of-things.html",
          "publishedOn": "2021-02-17T00:00:00.000Z",
          "wordCount": 596,
          "title": "Picking better names for variables, functions, and projects"
        },
        {
          "id": "https://macwright.com/2021/02/01/recently.html",
          "author": null,
          "description": "The last Recently feels like\na lot longer than a month away. In the undifferentiated temporal sprawl of the last\nyear, leaving my job in January marked a clear difference between between before\nand after. Not, though, in the sense that I haven’t been working. My time\nquickly filled up with a little freelance work, a lot of projects, and some pent-up\nenergy directed into reading and writing. I wrote\na few\nthings this month.\nFrustrated with SwiftUI, I abandoned the first version of a Gemini browser\nand am rewriting it in something else. It is abundantly clear that, as an unemployed person or not, I have zero chill.\nAnd thanks to everyone who has reached out re: my work thing!\nReading\nI am, of course, a sucker for Robin Rendle’s thing about newsletters.\nLike all technology on the upswing, it’…",
          "link": "https://macwright.com/2021/02/01/recently.html",
          "publishedOn": "2021-02-01T00:00:00.000Z",
          "wordCount": 641,
          "title": "Recently"
        }
      ]
    },
    {
      "title": "Stratechery by Ben Thompson",
      "feedUrl": "https://stratechery.com/feed",
      "siteUrl": "https://stratechery.com",
      "articles": [
        {
          "id": "https://stratechery.com/?p=6535",
          "author": "Ben Thompson",
          "description": "WWDC highlighted how Apple's differentiation is based on integration; the company ought not risk that differentiation for exploitive App Store policies.",
          "link": "https://stratechery.com/2021/integrated-apple-and-app-store-risk/",
          "publishedOn": "2021-06-08T11:21:37.000Z",
          "wordCount": 2790,
          "title": "Integrated Apple and App Store Risk"
        },
        {
          "id": "https://stratechery.com/?p=6443",
          "author": "Ben Thompson",
          "description": "Announcing Passport, the new infrastructure supporting Stratechery.",
          "link": "https://stratechery.com/2021/passport/",
          "publishedOn": "2021-06-03T18:36:17.000Z",
          "wordCount": 1988,
          "title": "Passport"
        },
        {
          "id": "https://stratechery.com/?p=6401",
          "author": "Ben Thompson",
          "description": "There are all kinds of arguments to make about the App Store, and nearly all of them are good ones; that's why the best solution can only come from Apple.",
          "link": "https://stratechery.com/2021/app-store-arguments/",
          "publishedOn": "2021-05-25T16:14:19.000Z",
          "wordCount": 4296,
          "title": "App Store Arguments"
        },
        {
          "id": "https://stratechery.com/?p=6357",
          "author": "Daman Rangoola",
          "description": "Distribution on the Internet is free; what matters is controlling demand. AT&T and Verizon didn't understand the distinction.",
          "link": "https://stratechery.com/2021/distribution-and-demand/",
          "publishedOn": "2021-05-18T12:57:39.000Z",
          "wordCount": 2566,
          "title": "Distribution and Demand"
        },
        {
          "id": "https://stratechery.com/?p=6346",
          "author": "Ben Thompson",
          "description": "Cloudflare is uniquely positioned to become a major player in an Internet 3.0 world, where politics matter more than economics.",
          "link": "https://stratechery.com/2021/cloudflare-on-the-edge/",
          "publishedOn": "2021-05-11T17:01:42.000Z",
          "wordCount": 3704,
          "title": "Cloudflare on the Edge"
        },
        {
          "id": "https://stratechery.com/?p=6334",
          "author": "Ben Thompson",
          "description": "More and more opportunities on the web come from market marking, not for advertisers, but for real goods and services paid for with real money.",
          "link": "https://stratechery.com/2021/market-making-on-the-internet/",
          "publishedOn": "2021-05-05T13:58:49.000Z",
          "wordCount": 2365,
          "title": "Market-Making on the Internet"
        },
        {
          "id": "https://stratechery.com/?p=6311",
          "author": "Daman Rangoola",
          "description": "Spotify's new subscription podcast offerings embrace the open ecosystem of podcasts in multiple ways.",
          "link": "https://stratechery.com/2021/spotifys-surprise/",
          "publishedOn": "2021-04-28T13:19:07.000Z",
          "wordCount": 2531,
          "title": "Spotify’s Surprise"
        },
        {
          "id": "https://stratechery.com/?p=6273",
          "author": "Ben Thompson",
          "description": "Apple's new Podcast Subscription service is what the App Store should be: a great Apple experience competing for customers.",
          "link": "https://stratechery.com/2021/podcast-subscriptions-vs-the-app-store/",
          "publishedOn": "2021-04-21T14:44:25.000Z",
          "wordCount": 2542,
          "title": "Podcast Subscriptions vs. the App Store"
        },
        {
          "id": "https://stratechery.com/?p=6234",
          "author": "Ben Thompson",
          "description": "Taylor Swift, like Dave Chappelle, is leveraging the power of the Internet to take control of their art.",
          "link": "https://stratechery.com/2021/non-fungible-taylor-swift/",
          "publishedOn": "2021-04-12T14:01:03.000Z",
          "wordCount": 2362,
          "title": "Non-Fungible Taylor Swift"
        },
        {
          "id": "https://stratechery.com/?p=6169",
          "author": "Ben Thompson",
          "description": "Substack is at the center of media controversy, most of which misses the point that sovereign writers — not Substack — are in control.",
          "link": "https://stratechery.com/2021/sovereign-writers-and-substack/",
          "publishedOn": "2021-03-22T14:46:50.000Z",
          "wordCount": 3323,
          "title": "Sovereign Writers and Substack"
        }
      ]
    }
  ],
  "cliVersion": "1.10.2"
}